---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CircuitWorksetClosedWarning
source: html/76cb7994-3b2c-7165-e55b-f68f7f251466.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CircuitWorksetClosedWarning Property

The workset of the circuit is closed so the circuit path will not be displayed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircuitWorksetClosedWarning { get; }
```